<?php
$library = [
    [
        'Назва' => '1984',
        'Автор' => 'Джордж Орвелл',
        'Рік' => 1949,
        'Жанр' => 'Антиутопія'
    ],
    [
        'Назва' => 'Убити пересмішника',
        'Автор' => 'Гарпер Лі',
        'Рік' => 1960,
        'Жанр' => 'Художня література'
    ],
    [
        'Назва' => 'Великий Гетсбі',
        'Автор' => 'Френсіс Скотт Фіцджеральд',
        'Рік' => 1925,
        'Жанр' => 'Художня література'
    ],
    [
        'Назва' => 'Майстер і Маргарита',
        'Автор' => 'Михайло Булгаков',
        'Рік' => 1967,
        'Жанр' => 'Містика'
    ],
    [
        'Назва' => 'Гордість і упередження',
        'Автор' => 'Джейн Остін',
        'Рік' => 1813,
        'Жанр' => 'Роман'
    ],
    [
        'Назва' => 'Ловець у житі',
        'Автор' => 'Джером Девід Селінджер',
        'Рік' => 1951,
        'Жанр' => 'Підлітковий роман'
    ],
    [
        'Назва' => 'Аліса в Країні Чудес',
        'Автор' => 'Льюїс Керролл',
        'Рік' => 1865,
        'Жанр' => 'Фантастика'
    ],
    [
        'Назва' => 'Книжковий злодій',
        'Автор' => 'Маркус Зусак',
        'Рік' => 2005,
        'Жанр' => 'Історична художня література'
    ],
    [
        'Назва' => 'Три товариші',
        'Автор' => 'Еріх Марія Ремарк',
        'Рік' => 1936,
        'Жанр' => 'Драма'
    ],
    [
        'Назва' => '451 градус за Фаренгейтом',
        'Автор' => 'Рей Бредбері',
        'Рік' => 1953,
        'Жанр' => 'Наукова фантастика'
    ],
    [
        'Назва' => 'Місто',
        'Автор' => 'Валер’ян Підмогильний',
        'Рік' => 1928,
        'Жанр' => 'Роман'
    ],
    [
        'Назва' => 'Тіні забутих предків',
        'Автор' => 'Михайло Коцюбинський',
        'Рік' => 1911,
        'Жанр' => 'Класика'
    ]
];


$serializedData = serialize($library);

file_put_contents('library.txt', $serializedData);

echo "Дані успішно сериалізовані и записані у файл.";
?>